spec/dummy/app/controllers/application_controller.rb

SELECT COUNT(*) FROM "projects" WHERE (( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ))
SELECT "projects".* FROM "projects" WHERE (( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ) AND ( projects.id LIKE ('%%') ))
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 25 AND "projects"."id" = 26
---
  def index
    if Project.count < 10
      10.times do |i|
        Project.create :title => "Project #{i}"
      end
    end

    projects_grid = fancygrid_for :projects, :builder => MyGrid, :persist => true do |grid|
      grid.ajax_url = "/index.html"
      grid.paginate = request.format.html?
      grid.find